Tekla Open API Reference for Tekla Structures 2025
Dialogs.LoadAttributeFileNameToDialogAndModify Method (String, String)
 Loads the specified dialog's current values from the attribute file and modifies the current selected instance.
 Namespace: Tekla.Structures.Dialog
 Assembly: Tekla.Structures.Dialog (in Tekla.Structures.Dialog.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public static bool LoadAttributeFileNameToDialogAndModify(
	string attributeFileName,
	string pluginFormName
)
Public Shared Function LoadAttributeFileNameToDialogAndModify (
	attributeFileName As String,
	pluginFormName As String
) As Boolean
Parameters
attributeFileName
Type: System.String
The name of the attribute file.
pluginFormName
Type: System.String
The full name of the dialog.
Return Value
Type: Boolean
True on success.
See Also
Reference
Dialogs Class
LoadAttributeFileNameToDialogAndModify Overload
Tekla.Structures.Dialog Namespace